emacs/.config/emacs/config.org
#+TITLE: My Emacs Configuration
#+AUTHOR: Amir Mohammad Taati

* Introduction
Welcome to my GNU Emacs configuration file. If you are a /vi vi vi/ user, leave immediately (just kiddin').

* Package Management
** Basic Settings
Require emacs's default package manager and also define package archives. (places where I'll be downloading packages)
#+begin_src emacs-lisp
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")  
			   ("org"   . "https://orgmode.org/elpa/")
                           ("gnu" . "https://elpa.gnu.org/packages/")
			   ("elpa"  . "https://elpa.gnu.org/packages/")
			   ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
#+end_src
** Use Package
I use =use-pacakge= to install and configure packages. It is fairly straighforward and easy to use.
#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src
* UI
** Basic Settings
When you open Emacs for the first time, you see lots of things going on. Menu bars, scroll bars, some text in scratch buffer and etc. This code
block gets rid of all of them and makes Emacs look minimal.
#+begin_src emacs-lisp
  (setq inhibit-startup-message t) 

  (when (display-graphic-p)
        (global-hl-line-mode))
        (column-number-mode)
        (global-display-line-numbers-mode t)

  (dolist (mode '(org-mode-hook
		  term-mode-hook
		  shell-mode-hook
		  treemacs-mode-hook
		  org-agenda-mode-hook
		  vterm-mode-hook
		  eshell-mode-hook))

  (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (setq make-backup-files nil)
  (setq debug-on-error t)
  (setq visible-bell 1)
  (setq electric-pair-preserve-balance nil)
  (setq tab-width 4)
  (setq frame-inhibit-implied-resize t)
  (scroll-bar-mode -1)              
  (tool-bar-mode   -1)             
  (tooltip-mode    -1)            
  (menu-bar-mode   -1)           
  (electric-pair-mode 1)
  (set-fringe-mode 20)
  #+end_src

** Transparency
I prefer to have transparent background. If you don't like it, just remove or comment this part.
#+begin_src emacs-lisp
  (defvar amt/frame-transparency '(90 . 90))
  (set-frame-parameter (selected-frame) 'alpha amt/frame-transparency)
  (add-to-list 'default-frame-alist `(alpha . ,amt/frame-transparency))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src
** Font
Configure font and its size. 
#+begin_src emacs-lisp
  (defvar amt/font-family "Fira Code Retina")
  (defvar amt/font-size 145)

  (set-face-attribute 'default nil
    :family amt/font-family
    :height amt/font-size)

  (set-face-attribute 'fixed-pitch nil
    :family amt/font-family 
    :height amt/font-size)

  (set-face-attribute 'variable-pitch nil
    :family amt/font-family 
    :height amt/font-size)

#+end_src
** Text Scaling
#+begin_src emacs-lisp
  (use-package default-text-scale
    :bind
    (("C-)" . default-text-scale-reset)
     ("C-=" . default-text-scale-increase)
     ("C--" . default-text-scale-decrease)))
#+end_src
** Dashboard
The dashboard to see when you startup the emacs for the first time.
#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (setq dashboard-set-footer nil)
    (setq dashboard-banner-logo-title "Welcome!")
    (setq dashboard-startup-banner 2)
    (setq dashboard-center-content t)
    (setq dashboard-show-shortcuts nil)
    (dashboard-setup-startup-hook))

#+end_src
** Theme
I use =doom-themes= package to set theme for emacs. It contains a list of diverse and beautiful themes.
#+begin_src emacs-lisp
  (defvar amt/theme 'doom-one)

  (use-package doom-themes
    :ensure t
    :config
    (setq doom-themes-enable-bold t)
    (setq doom-themes-enable-italic t) 
    (load-theme amt/theme t)
    (doom-themes-visual-bell-config)
    (doom-themes-neotree-config)
    (doom-themes-treemacs-config)
    (doom-themes-org-config))
#+end_src
** Modeline
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :hook (after-init . doom-modeline-mode))
#+end_src
** Which Key
#+begin_src emacs-lisp
  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))
#+end_src
** Ivy
#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
    :map ivy-minibuffer-map
       ("TAB" . ivy-alt-done)
       ("C-l" . ivy-alt-done)
       ("C-j" . ivy-next-line)
       ("C-k" . ivy-previous-line)
    :map ivy-switch-buffer-map
       ("C-k" . ivy-previous-line)
       ("C-l" . ivy-done)
       ("C-d" . ivy-switch-buffer-kill)
    :map ivy-reverse-i-search-map
       ("C-k" . ivy-previous-line)
       ("C-d" . ivy-reverse-i-search-kill))
    :config
       (ivy-mode 1))

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))

  (use-package ivy-prescient
    :after counsel
    :custom
      (ivy-prescient-enable-filtering nil)
    :config
      (prescient-persist-mode 1)
      (ivy-prescient-mode 1))

  (use-package all-the-icons-ivy-rich
    :init
    (all-the-icons-ivy-rich-mode 1))
#+end_src
** Counsel
#+begin_src emacs-lisp
  (use-package counsel
	    :bind
	    ("M-x" . 'counsel-M-x)
	    ("C-x b" . 'counsel-switch-buffer)
	    ("C-x C-f" . 'counsel-find-file)
	    ("C-s" . 'swiper)

	    :config
	    (use-package flx)

	    (ivy-mode 1)
	    (setq ivy-use-virtual-buffers t)
	    (setq ivy-count-format "(%d/%d) ")
	    (setq ivy-initial-inputs-alist nil)
	    (setq ivy-re-builders-alist
			  '((swiper . ivy--regex-plus)
			    (t . ivy--regex-fuzzy))))
#+end_src
* Keybinding
** Evil
It is really hard to use the default emacs keybindings. So, I use =evil-mode= to emulate vi keybindings in emacs.
#+begin_src emacs-lisp
  (use-package evil
    :ensure t
    :init
    (setq evil-want-keybinding nil)
    :config
    (evil-mode 1))

  (use-package evil-collection
    :after evil
    :ensure t
    :config
    (evil-collection-init))

  (use-package evil-surround
    :after evil
    :config
    (global-evil-surround-mode 1))

  (use-package evil-org
    :after (evil org)
    :demand t
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))
#+end_src
** Personal Keybindings
#+begin_src emacs-lisp 
  (global-set-key (kbd "<f1>") 'vterm)
#+end_src
* Development
** LSP
#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (
    (org-mode . lsp)
    (python-mode . lsp)
    (go-mode . lsp)
    (rust-mode . lsp)
    (lua-mode . lsp)
    (lsp-mode . lsp-enable-which-key-integration))
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t))

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))
#+end_src
** Company
#+begin_src emacs-lisp
  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :ensure t
    :bind (:map company-active-map
	   ("<tab>" . company-complete-selection))
	  (:map lsp-mode-map
	   ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))
#+end_src
** Flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :demand t
    :ensure t
    :config
    (global-flycheck-mode))
#+end_src
** Magit
** Projectile
#+begin_src  emacs-lisp
  (use-package projectile
    :ensure t
    :init
    (projectile-mode +1)
    :bind (:map projectile-mode-map
		("s-p" . projectile-command-map)
		("C-c p" . projectile-command-map)))

  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))
#+end_src 
** Languages
*** Julia
#+begin_src emacs-lisp
  (add-to-list 'load-path "/home/mamad/.config/emacs/julia-emacs")
  (add-to-list 'load-path "/home/mamad/.config/emacs/lsp-julia")
  (require 'julia-mode)
  (require 'lsp-julia)

#+end_src
*** Go
#+begin_src emacs-lisp
  (use-package go-mode
	:ensure-system-package (go . golang)
	:bind (:map go-mode-map ("C-c C-c" . compile)))

  (use-package protobuf-mode)

  (setenv "GOPATH" (expand-file-name "/home/mamad/go"))
;;  (+append-to-path (concat (getenv "GOPATH") "/bin"))

;;  (defun +install-go-save-hooks ()
;;    (add-hook 'before-save-hook #'lsp-format-buffer t t)
;;    (add-hook 'before-save-hook #'lsp-organize-imports t t))
 
;;  (add-hook 'go-mode-hook #'+install-go-save-hooks)
#+end_src

