emacs/.config/emacs/config.el
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")  
			 ("org"   . "https://orgmode.org/elpa/")
                         ("gnu" . "https://elpa.gnu.org/packages/")
			 ("elpa"  . "https://elpa.gnu.org/packages/")
			 ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(setq inhibit-startup-message t) 

(when (display-graphic-p)
      (global-hl-line-mode))
      (column-number-mode)
      (global-display-line-numbers-mode t)

(dolist (mode '(org-mode-hook
		term-mode-hook
		shell-mode-hook
		treemacs-mode-hook
		org-agenda-mode-hook
		vterm-mode-hook
		eshell-mode-hook))

(add-hook mode (lambda () (display-line-numbers-mode 0))))

(setq make-backup-files nil)
(setq debug-on-error t)
(setq visible-bell 1)
(setq electric-pair-preserve-balance nil)
(setq tab-width 4)
(setq frame-inhibit-implied-resize t)
(scroll-bar-mode -1)              
(tool-bar-mode   -1)             
(tooltip-mode    -1)            
(menu-bar-mode   -1)           
(electric-pair-mode 1)
(set-fringe-mode 20)

(defvar amt/frame-transparency '(90 . 90))
(set-frame-parameter (selected-frame) 'alpha amt/frame-transparency)
(add-to-list 'default-frame-alist `(alpha . ,amt/frame-transparency))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))

(defvar amt/font-family "Fira Code Retina")
(defvar amt/font-size 145)

(set-face-attribute 'default nil
  :family amt/font-family
  :height amt/font-size)

(set-face-attribute 'fixed-pitch nil
  :family amt/font-family 
  :height amt/font-size)

(set-face-attribute 'variable-pitch nil
  :family amt/font-family 
  :height amt/font-size)

(use-package default-text-scale
  :bind
  (("C-)" . default-text-scale-reset)
   ("C-=" . default-text-scale-increase)
   ("C--" . default-text-scale-decrease)))

(use-package dashboard
  :ensure t
  :config
  (setq dashboard-set-footer nil)
  (setq dashboard-banner-logo-title "Welcome!")
  (setq dashboard-startup-banner 2)
  (setq dashboard-center-content t)
  (setq dashboard-show-shortcuts nil)
  (dashboard-setup-startup-hook))

(defvar amt/theme 'doom-one)

(use-package doom-themes
  :ensure t
  :config
  (setq doom-themes-enable-bold t)
  (setq doom-themes-enable-italic t) 
  (load-theme amt/theme t)
  (doom-themes-visual-bell-config)
  (doom-themes-neotree-config)
  (doom-themes-treemacs-config)
  (doom-themes-org-config))

(use-package doom-modeline
  :ensure t
  :hook (after-init . doom-modeline-mode))

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 1))

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
  :map ivy-minibuffer-map
     ("TAB" . ivy-alt-done)
     ("C-l" . ivy-alt-done)
     ("C-j" . ivy-next-line)
     ("C-k" . ivy-previous-line)
  :map ivy-switch-buffer-map
     ("C-k" . ivy-previous-line)
     ("C-l" . ivy-done)
     ("C-d" . ivy-switch-buffer-kill)
  :map ivy-reverse-i-search-map
     ("C-k" . ivy-previous-line)
     ("C-d" . ivy-reverse-i-search-kill))
  :config
     (ivy-mode 1))

(use-package ivy-rich
  :after ivy
  :init
  (ivy-rich-mode 1))

(use-package ivy-prescient
  :after counsel
  :custom
    (ivy-prescient-enable-filtering nil)
  :config
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1))

(use-package all-the-icons-ivy-rich
  :init
  (all-the-icons-ivy-rich-mode 1))

(use-package counsel
	  :bind
	  ("M-x" . 'counsel-M-x)
	  ("C-x b" . 'counsel-switch-buffer)
	  ("C-x C-f" . 'counsel-find-file)
	  ("C-s" . 'swiper)

	  :config
	  (use-package flx)

	  (ivy-mode 1)
	  (setq ivy-use-virtual-buffers t)
	  (setq ivy-count-format "(%d/%d) ")
	  (setq ivy-initial-inputs-alist nil)
	  (setq ivy-re-builders-alist
			'((swiper . ivy--regex-plus)
			  (t . ivy--regex-fuzzy))))

(use-package evil
  :ensure t
  :init
  (setq evil-want-keybinding nil)
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))

(use-package evil-surround
  :after evil
  :config
  (global-evil-surround-mode 1))

(use-package evil-org
  :after (evil org)
  :demand t
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(global-set-key (kbd "<f1>") 'vterm)

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (
  (org-mode . lsp)
  (python-mode . lsp)
  (go-mode . lsp)
  (rust-mode . lsp)
  (lua-mode . lsp)
  (lsp-mode . lsp-enable-which-key-integration))
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :ensure t
  :bind (:map company-active-map
	 ("<tab>" . company-complete-selection))
	(:map lsp-mode-map
	 ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package flycheck
  :demand t
  :ensure t
  :config
  (global-flycheck-mode))

(use-package projectile
  :ensure t
  :init
  (projectile-mode +1)
  :bind (:map projectile-mode-map
	      ("s-p" . projectile-command-map)
	      ("C-c p" . projectile-command-map)))

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

(add-to-list 'load-path "/home/mamad/.config/emacs/julia-emacs")
(add-to-list 'load-path "/home/mamad/.config/emacs/lsp-julia")
(require 'julia-mode)
(require 'lsp-julia)

(use-package go-mode
	:ensure-system-package (go . golang)
	:bind (:map go-mode-map ("C-c C-c" . compile)))

  (use-package protobuf-mode)

  (setenv "GOPATH" (expand-file-name "/home/mamad/go"))
;;  (+append-to-path (concat (getenv "GOPATH") "/bin"))

;;  (defun +install-go-save-hooks ()
;;    (add-hook 'before-save-hook #'lsp-format-buffer t t)
;;    (add-hook 'before-save-hook #'lsp-organize-imports t t))
 
;;  (add-hook 'go-mode-hook #'+install-go-save-hooks)
