emacs/.config/emacs/config.el

(use-package rustic
  :bind (:map rustic-mode-map
	      ("M-j" . lsp-ui-imenu)
	      ("M-?" . lsp-find-references)
	      ("C-c C-c l" . flycheck-list-errors)
	      ("C-c C-c a" . lsp-execute-code-action)
	      ("C-c C-c r" . lsp-rename)
	      ("C-c C-c q" . lsp-workspace-restart)
	      ("C-c C-c Q" . lsp-workspace-shutdown)
	      ("C-c C-c s" . lsp-rust-analyzer-status))

  :config
  (setq lsp-rust-analyzer-cargo-watch-command "clippy")
  (setq lsp-rust-analyzer-server-display-inlay-hints t)

  (setq rustic-format-on-save t)
  (add-hook 'rustic-mode-hook '+rustic-mode-hook))

(defun +rustic-mode-hook ()
  (setq-local buffer-save-without-query t))

(use-package python-mode)

;;  (use-package elpy
;;    :after python-mode
;;    :custom
;;    (elpy-rpc-python-command "python3")
;;    :config
;;    (elpy-enable))

(use-package yasnippet
  :demand t
  :config
  (setq yas-indent-line 'auto)
  (yas-global-mode 1))

(use-package org
  :pin org
  :commands (org-capture org-agenda)
  :config
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1)
  (setq org-ellipsis " ▾")

(defun efs/org-mode-visual-fill ()
(setq visual-fill-column-width 150 
      visual-fill-column-center-text t)
      (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . efs/org-mode-visual-fill))

(add-to-list 'load-path "~/.config/emacs/dash/")
(add-to-list 'load-path "~/.config/emacs/s/")
(add-to-list 'load-path "~/.config/emacs/f/")
(add-to-list 'load-path "~/.config/emacs/ob-ipython/")

(org-babel-do-load-languages
  'org-babel-load-languages
      '((emacs-lisp . t)
	(lua . t)
	(julia . t)))

(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(setq org-directory "~/Documents/org/")
(use-package org-roam
  :after org
  :init (setq org-roam-v2-ack t) 
  :custom
  (org-roam-directory (file-truename org-directory))
  :config
  (org-roam-setup)
  (setq org-roam-completion-system 'ido)
  :bind (("C-c n f" . org-roam-node-find)
	 ("C-c n r" . org-roam-node-random)		    
	 (:map org-mode-map
	       (("C-c n i" . org-roam-node-insert)
		("C-c n o" . org-id-get-create)
		("C-c n t" . org-roam-tag-add)
		("C-c n a" . org-roam-alias-add)
		("C-c n l" . org-roam-buffer-toggle)))))

(global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c c") 'org-capture)

  (setq org-agenda-files
			'("~/Documents/org/gtd/next.org"
			  "~/Documents/org/gtd/inbox.org"
			  "~/Documents/org/gtd/wait.org"
			  "~/Documents/org/gtd/projects.org"
			  "~/Documents/org/gtd/repeat.org"
			  "~/Documents/org/gtd/calendar.org"
			  "~/Documents/org/gtd/habits.org"))

  (setq org-todo-keywords
	      '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
	      (sequence "WAITING(w)" "HOLDING(h)" "|" "CANC(c)")))

  (setq org-log-done 'time)
  (setq org-enforce-todo-dependencies t)

  (setq org-todo-keyword-faces
	    '(("TODO" . org-warning) ("NEXT" . "green")
	      ("CANCELED" . (:foreground "blue" :weight bold))))

  (setq org-capture-templates
	      `(("i" "inbox")
	       ("ii" "Task" entry (file+olp "~/Documents/org/gtd/inbox.org" "Inbox")
		"* TODO %? %(org-set-tags \"inbox\") \n  %U \n" :empty-lines 1)
("n" "note")
("nn" "Note" entry (file+olp "~/Documents/org/notes/notes.org" "Notes")
		"* TODO %?  \n  %U \n" :empty-lines 1)

("b" "book")
("bb" "Book" entry (file+olp "~/Documents/org/notes/books.org" "Books")
		"* TODO %?  \n  %U \n" :empty-lines 1)

))

  (setq org-agenda-prefix-format '((agenda . " %i %?-12t% s")
				     (todo . " %i ")
				     (tags . " %i ")
				     (search . " %i ")))

  (setq org-agenda-dim-blocked-tasks 'invisible)

  (setq org-refile-targets (quote ((nil :maxlevel . 9)
					   (org-agenda-files :maxlevel . 9)))))
  (setq org-agenda-window-setup 'current-window)
  (setq org-agenda-start-on-weekday nil)
  (setq org-agenda-block-separator ?─
	    org-agenda-time-grid
	    '((daily today require-timed)
	      (800 1000 1200 1400 1600 1800 2000)
	      " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
	    org-agenda-current-time-string
	    "⭠ now ─────────────────────────────────────────────────")
	     (setq org-agenda-custom-commands '())

	     (add-to-list 'org-agenda-custom-commands
		   '("p" "Personal agenda"
		     ((tags-todo "inbox|tickler+SCHEDULED=\"<today>\"|tickler+DEADLINE=\"<today>\""
				 ((org-agenda-overriding-header "Inbox")))

		      (tags-todo "next"
				 ((org-agenda-overriding-header "Next")))

		      (tags-todo "habit"
				 ((org-agenda-overriding-header "Habits")))

		      (agenda ""
			      ((org-agenda-overriding-header "Calendar")
			       (org-agenda-tag-filter-preset '("-next" "-habit"))))

		      (tags-todo "project"
				 ((org-agenda-overriding-header "Projects"))))

		     ((org-agenda-skip-deadline-if-done t)
		      (org-agenda-skip-scheduled-if-done t)
		      (org-agenda-skip-timestamp-if-done t)
		      (org-agenda-hide-tags-regexp "calendar\\|habit\\|inbox\\|next\\|project")
		      (org-agenda-tag-filter-preset '("-duplicate" "-news" "-writing")))))

(use-package ox-hugo
  :ensure t   
  :pin melpa  
  :after ox)
(setq org-hugo-base-dir "~/Documents/websites/amirmtaati.github.io")
(setq org-hugo-default-section-directory "blog")

(use-package deft
      :bind ("<f8>" . deft)
      :commands (deft)
      :config (setq deft-directory "~/Documents/notes"
		    deft-extensions '("md" "org"))
(setq deft-use-filename-as-title t))

(use-package vterm
  :commands vterm
  :config
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  
  ;;(setq vterm-shell "zsh")                      
  (setq vterm-max-scrollback 10000))

(use-package mu4e
  :ensure nil
  :config
  (require 'mu4e-org)

  (setq mu4e-change-filenames-when-moving t)

  (setq mu4e-update-interval (* 10 60))
  (setq mu4e-get-mail-command "mbsync -a")
  (setq mu4e-maildir "~/Mail")

  (setq mu4e-drafts-folder "/[Gmail]/Drafts")
  (setq mu4e-sent-folder   "/[Gmail]/Sent Mail")
  (setq mu4e-refile-folder "/[Gmail]/All Mail")
  (setq mu4e-trash-folder  "/[Gmail]/Trash")

  (setq mu4e-maildir-shortcuts
      '(("/Inbox"             . ?i)
	("/[Gmail]/Sent Mail" . ?s)
	("/[Gmail]/Trash"     . ?t)
	("/[Gmail]/Drafts"    . ?d)
	("/[Gmail]/All Mail"  . ?a))))

(setq smtpmail-smtp-server "smtp.gmail.com"
	smtpmail-smtp-service 587
	smtpmail-stream-type  'ssl)

;;  (setq message-send-mail-function 'smtpmail-send-it)

;  (add-to-list 'load-path "~/.config/emacs/xelb/")
;  (add-to-list 'load-path "~/.config/emacs/exwm/")
;  (require 'exwm)
;  (require 'exwm-config)
;  (exwm-config-example)
