emacs/.config/emacs/config.org
** Dired
#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer))

  (use-package dired-single
    :commands (dired dired-jump))

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package dired-open
    :commands (dired dired-jump)
    :config
    (setq dired-open-extensions '(("png" . "feh")
				  ("mkv" . "mpv"))))

  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))
#+end_src
** RSS 
#+begin_src emacs-lisp
  (setq elfeed-feeds
    '("http://nullprogram.com/feed/"
      "https://planet.emacslife.com/atom.xml"
      "https://www.discoverdev.io/rss.xml"
      "https://harryrschwartz.com/atom.xml"
      "https://xkcd.com/atom.xml"
      "https://rss.slashdot.org/Slashdot/slashdot"
      "https://www.wired.com/feed"
      "https://www.nature.com/nature.rss?error=cookies_not_supported&code=99469743-ac82-4849-96e3-089171bb1eef"
      "http://feeds.feedburner.com/codinghorror"
      "https://news.ycombinator.com/rss"
      "https://www.schneier.com/blog/atom.xml"
      "https://daringfireball.net/feeds/main"))
#+end_src
** IRC
#+begin_src emacs-lisp
    (with-eval-after-load 'ox-latex
      (add-to-list 'org-latex-classes '("letter" "\\documentclass{letter}"))
      )
  (eval-after-load "ox-latex"

    ;; update the list of LaTeX classes and associated header (encoding, etc.)
    ;; and structure
    '(add-to-list 'org-latex-classes
		  `("beamer"
		    ,(concat "\\documentclass[presentation]{beamer}\n"
			     "[DEFAULT-PACKAGES]"
			     "[PACKAGES]"
			     "[EXTRA]\n")
		    ("\\section{%s}" . "\\section*{%s}")
		    ("\\subsection{%s}" . "\\subsection*{%s}")
		    ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))
    
#+end_src
